# 테트로미노
# 정답 참고

import sys

input = sys.stdin.readline

N, M = map(int, input().split())
paper = [list(map(int, input().split())) for _ in range(N)]
tet = [
    [(0, 0), (0, 1), (0, 2), (0, 3)],  # 1자블록
    [(0, 0), (1, 0), (2, 0), (3, 0)],  # 1자블록
    [(0, 0), (0, 1), (1, 0), (1, 1)],  # 네모블록
    [(0, 0), (0, 1), (0, 2), (1, 0)],  # L자블록
    [(0, 2), (1, 0), (1, 1), (1, 2)],  # L자블록
    [(0, 0), (1, 0), (1, 1), (1, 2)],  # L자블록
    [(0, 0), (0, 1), (0, 2), (1, 2)],  # L자블록
    [(0, 0), (1, 0), (2, 0), (2, 1)],  # L자블록
    [(0, 1), (1, 1), (2, 1), (2, 0)],  # L자블록
    [(0, 0), (0, 1), (1, 0), (2, 0)],  # L자블록
    [(0, 0), (0, 1), (1, 1), (2, 1)],  # L자블록
    [(0, 1), (1, 0), (1, 1), (2, 0)],  # 계단블록
    [(0, 0), (1, 0), (1, 1), (2, 1)],  # 계단블록
    [(0, 1), (0, 2), (1, 0), (1, 1)],  # 계단블록
    [(0, 0), (0, 1), (1, 1), (1, 2)],  # 계단블록
    [(0, 0), (0, 1), (0, 2), (1, 1)],  # T자블록
    [(0, 1), (1, 0), (1, 1), (1, 2)],  # T자블록
    [(0, 0), (1, 0), (1, 1), (2, 0)],  # T자블록
    [(0, 1), (1, 0), (1, 1), (2, 1)],  # T자블록
]


def sol(x, y):
    global answer
    for i in range(19):
        result = 0
        for j in range(4):
            try:
                nx = x + tet[i][j][0]
                ny = y + tet[i][j][1]
                result += paper[nx][ny]
            except IndexError:
                continue
        answer = max(answer, result)


answer = 0
for i in range(N):
    for j in range(M):
        sol(i, j)

print(answer)
